{
  "model": "Google Pixel 10 Pro",
  "overview": "The Google Pixel 10 Pro is a flagship smartphone designed for users who value premium design, intelligent software, and cutting-edge camera performance. It features a large, immersive 6.7-inch display that delivers vibrant colors and smooth visuals, making it ideal for streaming, gaming, and everyday use. Powered by Google’s optimized hardware-software integration, the Pixel 10 Pro offers fast performance, efficient multitasking with 16GB RAM, and long-lasting battery life thanks to its 5100mAh battery. The 50MP advanced camera system focuses on AI-driven photography, producing sharp, natural images in all lighting conditions. With ample storage and a refined Android experience, the Pixel 10 Pro represents Google’s vision of a smart, powerful, and reliable premium smartphone.",
  "specs": [
    {
      "label": "Display",
      "value": "6.7 inches",
      "description": "A large, immersive display with excellent color accuracy, high brightness, and smooth scrolling, ideal for multimedia and productivity."
    },
    {
      "label": "Camera",
      "value": "50MP",
      "description": "A powerful AI-enhanced camera system capable of capturing detailed photos, realistic colors, and impressive low-light shots."
    },
    {
      "label": "Battery",
      "value": "5100mAh",
      "description": "A high-capacity battery designed to last a full day or more, even with heavy usage and AI-powered features."
    },
    {
      "label": "RAM",
      "value": "16GB",
      "description": "Plenty of memory for smooth multitasking, fast app switching, and future-ready performance."
    },
    {
      "label": "Resolution",
      "value": "FHD+",
      "description": "Sharp Full HD Plus resolution that ensures crisp text, clear images, and an overall premium viewing experience."
    },
    {
      "label": "Storage",
      "value": "256GB",
      "description": "Spacious internal storage for apps, photos, videos, and large files without worrying about running out of space."
    }
  ],
  "images": {
    "img1": "https://cdn.tmobile.com/content/dam/t-mobile/en-p/cell-phones/Google/Google-Pixel-10-Pro-XL/Moonstone/Google-Pixel-10-Pro-XL-Moonstone-leftimage.png",
    "img2": "https://cdn.tmobile.com/content/dam/t-mobile/en-p/cell-phones/Google/Google-Pixel-10-Pro-XL/Moonstone/Google-Pixel-10-Pro-XL-Moonstone-leftimage.png",
    "img3": "https://cdn.tmobile.com/content/dam/t-mobile/en-p/cell-phones/Google/Google-Pixel-10-Pro-XL/Moonstone/Google-Pixel-10-Pro-XL-Moonstone-leftimage.png"
  }
}